In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 路路路路

'Connected: root@sakila'

1. Write a query to display for each store its store ID, city, and country.

In [15]:
%%sql
select S.store_id, ci.city, C.country
from store S 
join address A
on S.address_id = A.address_id
join city as ci
on ci.city_id = A.city_id
join country as C
on Ci.country_id = C.country_id
;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Lethbridge', 'Canada'), (2, 'Woodridge', 'Australia')]

2. Write a query to display how much business, in dollars, each store brought in.

In [27]:
%%sql
select s.store_id, sum(p.amount) as total_amount
from store as s
join customer as c
on s.store_id = c.store_id
join payment as p
on c.customer_id = p.customer_id
group by s.store_id
;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, Decimal('36997.53')), (2, Decimal('30409.03'))]

3. What is the average running time of films by category?

In [37]:
%%sql
select c.name, round(avg(f.length), 2) as average_running_time
from film as f
join film_category as fc
on f.film_id = fc.film_id
join category as c
on c.category_id = fc.category_id
group by c.category_id
limit 7;

 * mysql+pymysql://root:***@localhost/sakila
7 rows affected.

[('Action', Decimal('111.61')),
 ('Animation', Decimal('111.02')),
 ('Children', Decimal('109.80')),
 ('Classics', Decimal('111.67')),
 ('Comedy', Decimal('115.83')),
 ('Documentary', Decimal('108.75')),
 ('Drama', Decimal('120.84'))]

4. Which film categories are longest?

In [36]:
%%sql
select c.name, round(avg(f.length), 2) as average_running_time
from film as f
join film_category as fc
on f.film_id = fc.film_id
join category as c
on c.category_id = fc.category_id
group by c.category_id
order by average_running_time desc
limit 7;

 * mysql+pymysql://root:***@localhost/sakila
7 rows affected.

[('Sports', Decimal('128.20')),
 ('Games', Decimal('127.84')),
 ('Foreign', Decimal('121.70')),
 ('Drama', Decimal('120.84')),
 ('Comedy', Decimal('115.83')),
 ('Family', Decimal('114.78')),
 ('Music', Decimal('113.65'))]

5. Display the most frequently rented movies in descending order.

In [42]:
%%sql
select film.title, count(rental.rental_id) as times_rented
from film 
join inventory
on film.film_id = inventory.film_id
join rental
on inventory.inventory_id = rental.inventory_id
group by film.title 
order by times_rented desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('BUCKET BROTHERHOOD', 34),
 ('ROCKETEER MOTHER', 33),
 ('FORWARD TEMPLE', 32),
 ('GRIT CLOCKWORK', 32),
 ('SCALAWAG DUCK', 32),
 ('JUGGLER HARDLY', 32),
 ('RIDGEMONT SUBMARINE', 32),
 ('ZORRO ARK', 31),
 ('HOBBIT ALIEN', 31),
 ('ROBBERS JOON', 31)]

6. List the top five genres in gross revenue in descending order.

In [53]:
%%sql
select category.name, category.category_id, round(sum(payment.amount), 2) as top_5_R_cat
from payment
join (rental join (inventory join (film_category join category using (category_id)) using (film_id)) using (inventory_id)) using (rental_id)
group by category.category_id
order by top_5_R_cat desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('Sports', 15, Decimal('5314.21')),
 ('Sci-Fi', 14, Decimal('4756.98')),
 ('Animation', 2, Decimal('4656.30')),
 ('Drama', 7, Decimal('4587.39')),
 ('Comedy', 5, Decimal('4383.58'))]

7. Is "Academy Dinosaur" available for rent from Store 1?

In [75]:
%%sql
select film.film_id, film.title, store.store_id, inventory.inventory_id
from sakila.inventory
join sakila.store using (store_id)
join sakila.film using (film_id)
where film.title = 'Academy Dinosaur' and store.store_id = 1;

 * mysql+pymysql://root:***@localhost/sakila
4 rows affected.

[(1, 'ACADEMY DINOSAUR', 1, 1),
 (1, 'ACADEMY DINOSAUR', 1, 2),
 (1, 'ACADEMY DINOSAUR', 1, 3),
 (1, 'ACADEMY DINOSAUR', 1, 4)]